// ==============================================================
// 1. কেন TypeScript শিখব ? (Why learn TypeScript)
// =============================================================

/* 
TypeScript এর মৈালিক উপকারিতা (সংক্ষেপে):

১. টাইপ সেফটি
-------------------------------------------------------------
ভুল টাইপ দিলেন কোড রান হওয়ার আগেই error দেখায়।
Bug কমে যায়।

২. অটোকম্পিট শক্তিশালি হয়
-------------------------------------------------------------
VS Code অনেক স্মার্ট সাজেশন দেয়, কোড লেখা দ্রুত হয়।

৩. বড় প্রজেক্টে মেইনটেইন করা সহজ হয়
--------------------------------------------------------------
টিমে কাজ হোক বা হাজার লাইনের কোড হোক , structure পরিষ্কার থাকে।

৪. বাগ আগে থেকে ধরা পড়ে
------------------------------------------------------------
Runtime error কমে কোয স্থিতিশীল হয়।

৫. JavaScript এর সব ফিচার + অতিরিক্ত ক্ষমতা 
---------------------------------------------------
JS এর সব সুবিধা তো আছেই সাথে টাইপ সিস্টেম, ইন্টারফেস, জেনরিকস, এনাম  ইত্যাদি বাড়তি সুবিধা।

৬. Refactoring safe হয়
--------------------------------------------------------------
Variable বা function name বদলালেও প্রজেক্ট জুড়ে সেফভাবে আপডেট হয়।

৭. Job market এ অত্যন্ত প্রয়োজনীয়
--------------------------------------------------------------


React, Next.js, Node.js, Express, NestJS, Prisma, সব জায়গায় TypeScript প্রেফার করা হয়।



*/